import React, { FunctionComponent, useState } from 'react'
import Container from '@material-ui/core/Container'
import Card from '@material-ui/core/Card'
import CardContent from '@material-ui/core/CardContent'
import Typography from '@material-ui/core/Typography'
import Box from '@material-ui/core/Box'
import Button from '@material-ui/core/Button'

export class AboutYenukaProps { }

const AboutYenuka: FunctionComponent<AboutYenukaProps> = () => {
  const [open, setOpen] = useState(false)
  return <>
    <Container className="margin-bottom-10 margin-top-2.5 padding-bottom-2.5">
      <Card raised className="radius-1">
        <CardContent color="main" className="text-center relative">
          <Typography variant="h3" component="h5" color="secondary" className="margin-bottom-1.2 margin-top-3">אודות הינוקא</Typography>
          <Typography variant="h5" className="padding-2 text-justify margin-bottom-1.2">
            <Box component="p" className="fw-bold">הגאון הפלאי הצדיק הינוקא - האור שזורח ומאיר את עולם היהדות.</Box>
            <Box component="p">שחר ילדותו היתה ברובע היהודי העתיק בעיר גירונה שבספרד, עיר מולדתם של מאורי הדורות הראשונים, רבנו יונה, הרמב''ן ועוד. לאחר מכן עברו הוריו לעיר סיבליה. את ילדותו המיוחדת והטהורה הקדיש וקידש באהבת לימוד תורה וכתיבת חיבורים בתורה. </Box>
            <Box component="p">מושא חייו היה אהבת הבורא. כתחביב היה מצייר לו ציורים עם מאמרי התבוננות בגדולתו וכותב לו מכתבים ותפלות, היה אוסף בערגה תמונות צדיקים והיה מביט בהם רבות, עם השנים נאגרו לאוסף של אלפי תמונות מהם נדירות ביותר. והיה בקיא בהם בכולם בהנהגותיהם, חיבוריהם, בביוגרפיה של כל אחד ובשושלתם כולם. ניכר היה להוריו ומכיריו כי כאן צומח אילן ענק מענקי הדורות.{!open && <>..</>}</Box>
            {
              open && <>
                <Box component="p"> הינוקא החל את כתיבת חיבוריו ושיעוריו כבר מיד לאחר גיל בר מצווה, וכשעלה ארצה בגיל 14 כבר היה בקיא בנהירות בכל ספרי חז''ל והזוהר בנוסף לתלמוד בבלי ירושלמי ומפרשים בעיון ומראי מקומות. עם הזמן החלו נוהרים לבית מדרשו תלמידי חכמים עצומים, רבנים, מוצ''ים, ומגדולי ישראל ששמעו את שמעו ובאו אל שיעוריו, וראו בו את דמותו של הינוקא המופיע בזוהר הקדוש ומאז כינוהו ''הינוקא''.  </Box>
                <Box component="p">בגיל 19 כבר השלים כמה מחיבוריו על התורה ועוד, וכן ספר תפלות עצומות שחיבר ע''פ חז''ל והסוד.</Box>
                <Box component="p">הינוקא עושה היסטוריה בידיעותיו בכל ספרי היהדות כולם; התנ''ך ומפרשיו וכל ספרי חז''ל, ש''ס בבלי וירושלמי ומפרשיהם, חיבורי הראשונים והאחרונים ספרי השו''ת וכל תורת הקבלה, כל ספרי פרד''ס התורה וכל החיבורים שנתחברו מחכמי ליטא כהגאון מוילנא -  ועד החזון איש, כל תורת החסידות מהבעש''ט ועד כל תלמידיו ושושלתם כולם חב''ד ברסלב סאטמר צאנז גור וכו'.. כולם ביחד חקוקים במוחו בהיקף אדיר ונדיר. כשנשאל פעם איך זכה לכזה זכרון קדושה, ענה; ''דבר שאוהבים לא שוכחים''.. </Box>
                <Box component="p">הינוקא מחבר את התורה מכל קצותיה ובידיעתו המופלאה והכוללת, מגלה את מידות התורה ההלכה והמוסר ועד ההנהגה, באחדות דיעותיהם של כל גדולי ישראל לדורותיהם מכל גווני הקשת, לתורה ודרך ברורה, מלאה ביראת השם עמוקה ושרשית, המתקבלת על לב כולם ומאחדת את כולם לדרך עבודת ה' בהירה ומאירה המחזירה עטרה ליושנה.</Box>
                <Box component="p">שיעוריו בדרך כלל מתחילים משאלה או נושא שעלה, וכאן מתגלה לעין מופת מאמר חז''ל; ''סיני, עוקר הרים וטוחנן זה בזה''. הינוקא פורס ומגלה בכל נושא כל שהוא שעלה, מהלכים בתורה באופן מבהיל רעיון, תוך כדי שהוא מצטט דבריו מכל חלקי פרד''ס התורה כולה, מהמדרש הפסיקה ההלכה הסוד וכל הגדולים. המאזין לשיעוריו מתחילתם לסופם, נחשף ליצירת מופת וגילוי נורא הוד בתורה - שרשרת של תובנות עצומות בתורה עמוקות ושורשיות, שמתגלית במקום ללא שום הכנה, הכל רואים שרוח הקודש מדברת מגרונו.</Box>
                <Box component="p">מחזה כזה לא נראה כמותו מזה דורות, בחור צעיר לימים שעדיין לא מלאו לו 20, יושבים לפניו זקנים וגאוני ארץ לשמוע דרשותיו בתורה, לקבל ממנו דרך יראת ה', והכל שמחים בו כמוצא שלל.</Box>
                <Box component="p">בסיום השיעור הרב מנגן על פסנתר בכשרון מיוחד ניגונים המיוחסים לצדיקים, כאשר כמה נגנים ובראשם הכנר המפורסם דניאל אהביאל והחזן הנודע הרב חיים אליעזר הרשטיק מצטרפים לנגינתו של הרב.</Box>
                <Box component="p">בתשוקתו לתורה הינוקא זכה בשנים מעטות, ביגיעה רבה ובשמירת זמן מדוקדקת, להקיף כל חלקי התורה, עשרות אלפי ספרים, זה מופת שלא נראה כמותו רק אצל ענקי הדורות כהרמב''ם האריז''ל, הרמח"ל, הרמ"א, הבעש"ט ועוד, שכולם התגלו בצעירותם, נשמות קדושות ועצומות שקבלו התורה - ''ערוכה בכל ושמורה'' והקיפו כל התורה, ובכוח תורתם וקדושתם פעלו גדולות ונצורות ניסים ואותות והרבו טובות לעם ישראל. כאז כן עתה, עדים אנו לנשמה של ענקי הדורות וכוח תורה שעימו – ערוכה בכל ושמורה, ורבים זכו לישועה ומופתים בתפלותיו וברכותיו, וראו את ראייתו למרחוק, ורוח פיו, שככל היוצא מפיו נעשה - צדיק גזר והקב''ה קיים.</Box>
                <Box component="p">גדולי ישראל התבטאו רבות בשבחו. ביניהם אמרו שחכמתו רחבה מיני ים, נשמה קדושה כזו יורדת אחת להרבה דורות! אחד מגדולי ישראל התבטא עליו שנשמתו לא מדורנו אלא מתקופת הנביאים! זה אוצר יקר ונכס גדול לעולם התורה ולעם ישראל כולו! הינוקא מיוחד באהבת ישראל שבו, בפשטות ובענוה ובכבוד העצום שהוא רוחש לכל יהודי. עובדא מדהימה המעידה על כך שכל אחד שביקש ברכתו זוכר אותו גם לאחר עשר שנים. כל מי שנחשף לדמותו של הרב מתמלא תקווה ושמחה, לראות בעין את ההבטחה; ''כי לא תשכח מפי זרעו''; לראות את פעולת השם; ''עמד ושתלם בכל דור'', לראות את דרך ממשיכי התורה ושומרי שעריה.</Box>
              </>
            }
          </Typography>
          {!open && <Button variant="text" color="secondary" className="absolute left bottom margin-2" onClick={() => setOpen(true)}>קרא עוד</Button>}
        </CardContent>
      </Card>
    </Container>
  </>
}

export default AboutYenuka